---
kind: type
id: T:Autodesk.Revit.DB.Location
source: html/3dbe57e5-fdea-5bf9-c715-52653f56073f.htm
---
# Autodesk.Revit.DB.Location

Provides location functionality for all elements.

## Syntax (C#)
```csharp
public class Location : APIObject
```

## Remarks
The location object provides the ability to translate and rotate elements. More
detailed location information and control can be found by using the derivatives of this
object, such as LocationPoint or LocationCurve.